[Rainmeter]
Update=1
; Context menu option to change time to 12-hour format (shows AM/PM)
ContextTitle="12-hour time"
ContextAction=[!WriteKeyValue MeasureHour Format %#I #CoreFilePath#][!WriteKeyValue MeasureAMPM Disabled 0 #CoreFilePath#][!WriteKeyValue TimeAMPM Hidden 0 #CoreFilePath#][!Refresh]
; Context menu option to change time to 24-hour format (hides AM/PM)
ContextTitle2="24-hour time"
ContextAction2=[!WriteKeyValue MeasureHour Format %#H #CoreFilePath#][!WriteKeyValue MeasureAMPM Disabled 1 #CoreFilePath#][!WriteKeyValue TimeAMPM Hidden 1 #CoreFilePath#][!Refresh]

